/* NSExecutableNotLoadableError */
"BundleErr3584" = "تعذر تحميل المجموعة \"%@‎\" نظرًا لأن المكوّن التنفيذي الخاص بها غير قابل للتحميل.";

/* NSExecutableNotLoadableError */
"BundleErr3584-C" = "المكوّن التنفيذي للمجموعة غير قابل للتحميل.";

/* NSExecutableNotLoadableError */
"BundleErr3584-R" = "جرِّب إعادة تثبيت الحزمة.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585" = "تعذر تحميل المجموعة \"%@‎\" نظرًا لعدم احتوائها على إصدار للبنية الحالية.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585-C" = "لا تحتوي المجموعة على إصدار للبنية الحالية.";

/* NSExecutableArchitectureMismatchError */
"BundleErr3585-R" = "جرِّب تثبيت إصدار عام من الحزمة.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586" = "تعذر تحميل المجموعة \"%@‎\" نظرًا لعدم توافقها مع التطبيق الحالي.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586-C" = "المجموعة غير متوافقة مع هذا التطبيق.";

/* NSExecutableRuntimeMismatchError */
"BundleErr3586-R" = "جرِّب تثبيت إصدار أحدث من الحزمة.";

/* NSExecutableLoadError */
"BundleErr3587" = "تعذر تحميل المجموعة \"%@‎\" نظرًا لأنها تالفة أو تفتقد إلى موارد ضرورية.";

/* NSExecutableLoadError */
"BundleErr3587-C" = "إما أن الحزمة تالفة أو هناك موارد ضرورية مفقودة.";

/* NSExecutableLoadError */
"BundleErr3587-R" = "جرِّب إعادة تثبيت الحزمة.";

/* NSExecutableLinkError */
"BundleErr3588" = "تعذر تحميل المجموعة \"%@‎\".";

/* NSExecutableLinkError */
"BundleErr3588-C" = "تعذر تحميل المجموعة.";

/* NSExecutableLinkError */
"BundleErr3588-R" = "جرِّب إعادة تثبيت الحزمة.";

/* NSFileNoSuchFileError */
"BundleErr4" = "تعذر تحميل المجموعة \"%@‎\" نظرًا لتعذر تحديد موقع المكوّن التنفيذي الخاص بها.";

/* NSFileNoSuchFileError */
"BundleErr4-C" = "تعذر تحديد موقع المكوّن التنفيذي للمجموعة.";

/* NSFileNoSuchFileError */
"BundleErr4-R" = "جرِّب إعادة تثبيت الحزمة.";

/* Name of the 'Cocoa' error domain when showing to user. Very likely this will not get localized. */
"NSCocoaErrorDomain" = "Cocoa";

/* Name of the 'Core Foundation' error domain when showing to user. Very likely this will not get localized differently in other languages. */
"NSCoreFoundationErrorDomain" = "Core Foundation";

/* Name of the 'Mach' error domain when showing to user. This probably will not get localized, unless there is a generally recognized phrase for 'Mach' in the language. */
"NSMachErrorDomain" = "Mach";

/* Name of the 'OSStatus' error domain when showing to user. Very likely this will not get localized. */
"NSOSStatusErrorDomain" = "OSStatus";

/* Name of the 'POSIX' error domain when showing to user. This probably will not get localized, unless there is a generally recognized phrase for 'POSIX' in the language. */
"NSPOSIXErrorDomain" = "POSIX";

/* A generic error string indicating there was a problem. The %@ will be replaced by a second sentence which indicates why the operation failed. */
"The operation couldn\\U2019t be completed. %@" = "تعذر إكمال العملية. %@‎";

/* A generic error string indicating there was a problem, followed by a parenthetical sentence which indicates error domain, code, and a description when there is no other way to present an error to the user. The first %@ indicates the error domain, %ld indicates the error code, and the second %@ indicates the description; so this might become '(Mach error 42 - Server error.)' for instance. */
"The operation couldn\\U2019t be completed. (%@ error %ld - %@)" = "تعذر إكمال العملية. ‫(%1$@‎ خطأ %2$ld‎ -‏ %3$@‎)‬";

/* A generic error string indicating there was a problem, followed by a parenthetical sentence which indicates error domain and code when there is no other way to present an error to the user. The %@ indicates the error domain while %ld indicates the error code; so this might become '(Mach error 42.)' for instance. */
"The operation couldn\\U2019t be completed. (%@ error %ld.)" = "تعذر إكمال العملية. ‫(خطأ في %1$@‎ %2$ld.)‬";

